<?php
//Create by Loger. Skype: trofimov1995trofimov
// Скрипт написан под 2 базы. Т.к. У меня сервер подключен к 1 базе, а DLE к другой. Если у вас подключено к 1 базе
// просто укажите одинаковые данные.

 //++++++++++++++++++++++===================================+++++++++++++++++++++++++++++++

 $db_host = 'localhost'; //Хост базы
 
 $db_user = 'user'; // Пользователь базы
 
 $db_pass = 'password'; // Пароль базы
 
 $db_base = 'base_name'; // Название базы
 
 $db_table = 'itemstorage'; // Таблица itemstorage
 
 $db_items = 'items'; // Таблица с итемами
 
 //++++++++++++++++++++++===================================+++++++++++++++++++++++++++++++
 
 $host_cms = 'base_host_dle';// Хост базы DLE
 
 $db_cms = 'name_base_dle'; // База DLE
 
 $pass_cms = 'password'; // Пароль базы DLE
 
 $user_cms = 'user_dle'; // Пользователь базы DLE 
 
 $table_cms = 'dle_users'; // Таблица с пользователями DLE
 
  //++++++++++++++++++++++===================================+++++++++++++++++++++++++++++++
 
  //++++++++++++++++++++++Дальше не трогать+++++++++++++++++++++++++++++++
 
 $uid = $_COOKIE['dle_user_id'];
 
 $password = $_COOKIE['dle_password'];
 
 $link = mysql_connect($db_host, $db_user, $db_pass);
 ?>